Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_CMU_ECLK_NUM_Bits.ECLK_NUM */
#define IFX_GTM_CMU_ECLK_NUM_ECLK_NUM_LEN (24u)

/** \brief Mask for Ifx_GTM_CMU_ECLK_NUM_Bits.ECLK_NUM */
#define IFX_GTM_CMU_ECLK_NUM_ECLK_NUM_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_CMU_ECLK_NUM_Bits.ECLK_NUM */
#define IFX_GTM_CMU_ECLK_NUM_ECLK_NUM_OFF (0u)

/** \brief Length for Ifx_GTM_CMU_ECLK_DEN_Bits.ECLK_DEN */
#define IFX_GTM_CMU_ECLK_DEN_ECLK_DEN_LEN (24u)

/** \brief Mask for Ifx_GTM_CMU_ECLK_DEN_Bits.ECLK_DEN */
#define IFX_GTM_CMU_ECLK_DEN_ECLK_DEN_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_CMU_ECLK_DEN_Bits.ECLK_DEN */
#define IFX_GTM_CMU_ECLK_DEN_ECLK_DEN_OFF (0u)

/** \brief Length for Ifx_GTM_CMU_FXCLK_CTRL_Bits.FXCLK_SEL */
#define IFX_GTM_CMU_FXCLK_CTRL_FXCLK_SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_CMU_FXCLK_CTRL_Bits.FXCLK_SEL */
#define IFX_GTM_CMU_FXCLK_CTRL_FXCLK_SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CMU_FXCLK_CTRL_Bits.FXCLK_SEL */
#define IFX_GTM_CMU_FXCLK_CTRL_FXCLK_SEL_OFF (0u)

/** \brief Length for Ifx_GTM_CMU_GLB_CTRL_Bits.ARU_ADDR_RSTGLB */
#define IFX_GTM_CMU_GLB_CTRL_ARU_ADDR_RSTGLB_LEN (1u)

/** \brief Mask for Ifx_GTM_CMU_GLB_CTRL_Bits.ARU_ADDR_RSTGLB */
#define IFX_GTM_CMU_GLB_CTRL_ARU_ADDR_RSTGLB_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMU_GLB_CTRL_Bits.ARU_ADDR_RSTGLB */
#define IFX_GTM_CMU_GLB_CTRL_ARU_ADDR_RSTGLB_OFF (0u)

/** \brief Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK0_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK0_EXT_DIVIDER_LEN (1u)

/** \brief Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK0_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK0_EXT_DIVIDER_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK0_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK0_EXT_DIVIDER_OFF (0u)

/** \brief Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK1_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK1_EXT_DIVIDER_LEN (1u)

/** \brief Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK1_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK1_EXT_DIVIDER_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK1_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK1_EXT_DIVIDER_OFF (1u)

/** \brief Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK2_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK2_EXT_DIVIDER_LEN (1u)

/** \brief Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK2_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK2_EXT_DIVIDER_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK2_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK2_EXT_DIVIDER_OFF (2u)

/** \brief Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK3_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK3_EXT_DIVIDER_LEN (1u)

/** \brief Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK3_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK3_EXT_DIVIDER_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK3_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK3_EXT_DIVIDER_OFF (3u)

/** \brief Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK4_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK4_EXT_DIVIDER_LEN (1u)

/** \brief Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK4_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK4_EXT_DIVIDER_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK4_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK4_EXT_DIVIDER_OFF (4u)

/** \brief Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK5_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK5_EXT_DIVIDER_LEN (1u)

/** \brief Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK5_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK5_EXT_DIVIDER_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK5_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK5_EXT_DIVIDER_OFF (5u)

/** \brief Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK6_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK6_EXT_DIVIDER_LEN (1u)

/** \brief Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK6_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK6_EXT_DIVIDER_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK6_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK6_EXT_DIVIDER_OFF (6u)

/** \brief Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK7_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK7_EXT_DIVIDER_LEN (1u)

/** \brief Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK7_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK7_EXT_DIVIDER_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK7_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK7_EXT_DIVIDER_OFF (7u)

/** \brief Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK8_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK8_EXT_DIVIDER_LEN (1u)

/** \brief Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK8_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK8_EXT_DIVIDER_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK8_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK8_EXT_DIVIDER_OFF (8u)

/** \brief Length for Ifx_GTM_BRC_SRC_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC_ADDR_ADDR_LEN (9u)

/** \brief Mask for Ifx_GTM_BRC_SRC_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC_ADDR_ADDR_MSK (0x1ffu)

/** \brief Offset for Ifx_GTM_BRC_SRC_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC_ADDR_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_BRC_SRC_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC_ADDR_BRC_MODE_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC_ADDR_BRC_MODE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC_ADDR_BRC_MODE_OFF (12u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST0_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST0_OFF (0u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST1_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST1_OFF (1u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST2_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST2_OFF (2u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST3_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST3_OFF (3u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST4_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST4_OFF (4u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST5_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST5_OFF (5u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST6_LEN (1u)

