Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST6_OFF (6u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST7_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST7_OFF (7u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST8_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST8_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST8_OFF (8u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST9_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST9_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST9_OFF (9u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST10_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST10_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST10_OFF (10u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST11_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST11_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST11_OFF (11u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST12_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST12_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST12_OFF (12u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST13_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST13_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST13_OFF (13u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST14 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST14_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST14 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST14_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST14 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST14_OFF (14u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST15 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST15_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST15 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST15_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST15 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST15_OFF (15u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST16 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST16_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST16 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST16_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST16 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST16_OFF (16u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST17 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST17_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST17 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST17_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST17 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST17_OFF (17u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST18 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST18_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST18 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST18_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST18 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST18_OFF (18u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST19 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST19_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST19 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST19_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST19 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST19_OFF (19u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST20_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST20_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST20_OFF (20u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST21_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST21_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST21_OFF (21u)

/** \brief Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC_DEST_EN_TRASHBIN_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC_DEST_EN_TRASHBIN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC_DEST_EN_TRASHBIN_OFF (22u)

/** \brief Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DEST_ERR */
#define IFX_GTM_BRC_IRQ_NOTIFY_DEST_ERR_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DEST_ERR */
#define IFX_GTM_BRC_IRQ_NOTIFY_DEST_ERR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DEST_ERR */
#define IFX_GTM_BRC_IRQ_NOTIFY_DEST_ERR_OFF (0u)

/** \brief Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID0 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID0_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID0 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID0 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID0_OFF (1u)

/** \brief Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID1 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID1_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID1 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID1 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID1_OFF (2u)

