Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS1_CH7_IRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH0_IRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH1_IRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH2_IRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH3_IRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH4_IRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH5_IRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH6_IRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH7_IRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH0_IRQ_OFF (24u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH1_IRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH2_IRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH3_IRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH4_IRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH5_IRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH6_IRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH7_IRQ_OFF (31u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH2_IRQ_MSK (0x1u)

