Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH5_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH6_IRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH7_IRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH0_IRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH1_IRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH2_IRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH3_IRQ_OFF (11u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH4_IRQ_OFF (12u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH5_IRQ_OFF (13u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH6_IRQ_OFF (14u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS5_CH7_IRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH0_IRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH1_IRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH2_IRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH3_IRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH4_IRQ_MSK (0x1u)

