Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SGE1_OFF (5u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_DLM1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_DLM1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_DLM1_OFF (6u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_PCM1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_PCM1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_PCM1_OFF (7u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DMO_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DMO_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DMO_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_COA_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_COA_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_COA_OFF (3u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_SGE1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_SGE1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_SGE1_OFF (5u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DLM1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DLM1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DLM1_OFF (6u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_PCM1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_PCM1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_PCM1_OFF (7u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_SGE2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_SGE2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_SGE2_OFF (8u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DLM2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DLM2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DLM2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DLM2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DLM2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DLM2_OFF (9u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.PCM2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_PCM2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.PCM2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_PCM2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.PCM2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_PCM2_OFF (10u)

/** \brief Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1A */
#define IFX_GTM_DPLL_RAM_INI_INIT_1A_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1A */
#define IFX_GTM_DPLL_RAM_INI_INIT_1A_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1A */
#define IFX_GTM_DPLL_RAM_INI_INIT_1A_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1BC */
#define IFX_GTM_DPLL_RAM_INI_INIT_1BC_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1BC */
#define IFX_GTM_DPLL_RAM_INI_INIT_1BC_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1BC */
#define IFX_GTM_DPLL_RAM_INI_INIT_1BC_OFF (1u)

/** \brief Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_2 */
#define IFX_GTM_DPLL_RAM_INI_INIT_2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_2 */
#define IFX_GTM_DPLL_RAM_INI_INIT_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_2 */
#define IFX_GTM_DPLL_RAM_INI_INIT_2_OFF (2u)

/** \brief Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_RAM */
#define IFX_GTM_DPLL_RAM_INI_INIT_RAM_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_RAM */
#define IFX_GTM_DPLL_RAM_INI_INIT_RAM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_RAM */
#define IFX_GTM_DPLL_RAM_INI_INIT_RAM_OFF (4u)

/** \brief Length for Ifx_GTM_DPLL_PSA_Bits.PSA */
#define IFX_GTM_DPLL_PSA_PSA_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_PSA_Bits.PSA */
#define IFX_GTM_DPLL_PSA_PSA_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_PSA_Bits.PSA */
#define IFX_GTM_DPLL_PSA_PSA_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_DLA_Bits.DLA */
#define IFX_GTM_DPLL_DLA_DLA_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_DLA_Bits.DLA */
#define IFX_GTM_DPLL_DLA_DLA_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_DLA_Bits.DLA */
#define IFX_GTM_DPLL_DLA_DLA_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_NA_Bits.DB */
#define IFX_GTM_DPLL_NA_DB_LEN (10u)

/** \brief Mask for Ifx_GTM_DPLL_NA_Bits.DB */
#define IFX_GTM_DPLL_NA_DB_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_DPLL_NA_Bits.DB */
#define IFX_GTM_DPLL_NA_DB_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_NA_Bits.DW */
#define IFX_GTM_DPLL_NA_DW_LEN (10u)

/** \brief Mask for Ifx_GTM_DPLL_NA_Bits.DW */
#define IFX_GTM_DPLL_NA_DW_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_DPLL_NA_Bits.DW */
#define IFX_GTM_DPLL_NA_DW_OFF (10u)

