Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WERZ1 */
#define IFX_GTM_DPLL_CTRL_11_WERZ1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WERZ1 */
#define IFX_GTM_DPLL_CTRL_11_WERZ1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WERZ1 */
#define IFX_GTM_DPLL_CTRL_11_WERZ1_OFF (17u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF1 */
#define IFX_GTM_DPLL_CTRL_11_WPCMF1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF1 */
#define IFX_GTM_DPLL_CTRL_11_WPCMF1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF1 */
#define IFX_GTM_DPLL_CTRL_11_WPCMF1_OFF (18u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WFSYL1 */
#define IFX_GTM_DPLL_CTRL_11_WFSYL1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WFSYL1 */
#define IFX_GTM_DPLL_CTRL_11_WFSYL1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WFSYL1 */
#define IFX_GTM_DPLL_CTRL_11_WFSYL1_OFF (19u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WINCF1 */
#define IFX_GTM_DPLL_CTRL_11_WINCF1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WINCF1 */
#define IFX_GTM_DPLL_CTRL_11_WINCF1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WINCF1 */
#define IFX_GTM_DPLL_CTRL_11_WINCF1_OFF (20u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF1_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_WPCMF1_INCCNT_B_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF1_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_WPCMF1_INCCNT_B_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF1_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_WPCMF1_INCCNT_B_OFF (21u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WADT */
#define IFX_GTM_DPLL_CTRL_11_WADT_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WADT */
#define IFX_GTM_DPLL_CTRL_11_WADT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WADT */
#define IFX_GTM_DPLL_CTRL_11_WADT_OFF (22u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WADS */
#define IFX_GTM_DPLL_CTRL_11_WADS_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WADS */
#define IFX_GTM_DPLL_CTRL_11_WADS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WADS */
#define IFX_GTM_DPLL_CTRL_11_WADS_OFF (23u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WSIP2 */
#define IFX_GTM_DPLL_CTRL_11_WSIP2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WSIP2 */
#define IFX_GTM_DPLL_CTRL_11_WSIP2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WSIP2 */
#define IFX_GTM_DPLL_CTRL_11_WSIP2_OFF (24u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WERZ2 */
#define IFX_GTM_DPLL_CTRL_11_WERZ2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WERZ2 */
#define IFX_GTM_DPLL_CTRL_11_WERZ2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WERZ2 */
#define IFX_GTM_DPLL_CTRL_11_WERZ2_OFF (25u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF2 */
#define IFX_GTM_DPLL_CTRL_11_WPCMF2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF2 */
#define IFX_GTM_DPLL_CTRL_11_WPCMF2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF2 */
#define IFX_GTM_DPLL_CTRL_11_WPCMF2_OFF (26u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WFSYL2 */
#define IFX_GTM_DPLL_CTRL_11_WFSYL2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WFSYL2 */
#define IFX_GTM_DPLL_CTRL_11_WFSYL2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WFSYL2 */
#define IFX_GTM_DPLL_CTRL_11_WFSYL2_OFF (27u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WINCF2 */
#define IFX_GTM_DPLL_CTRL_11_WINCF2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WINCF2 */
#define IFX_GTM_DPLL_CTRL_11_WINCF2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WINCF2 */
#define IFX_GTM_DPLL_CTRL_11_WINCF2_OFF (28u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF2_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_WPCMF2_INCCNT_B_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF2_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_WPCMF2_INCCNT_B_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF2_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_WPCMF2_INCCNT_B_OFF (29u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WSTATE_EXT */
#define IFX_GTM_DPLL_CTRL_11_WSTATE_EXT_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WSTATE_EXT */
#define IFX_GTM_DPLL_CTRL_11_WSTATE_EXT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WSTATE_EXT */
#define IFX_GTM_DPLL_CTRL_11_WSTATE_EXT_OFF (30u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WACBU */
#define IFX_GTM_DPLL_CTRL_11_WACBU_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WACBU */
#define IFX_GTM_DPLL_CTRL_11_WACBU_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WACBU */
#define IFX_GTM_DPLL_CTRL_11_WACBU_OFF (31u)

/** \brief Length for Ifx_GTM_DPLL_THVAL2_Bits.THVAL */
#define IFX_GTM_DPLL_THVAL2_THVAL_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_THVAL2_Bits.THVAL */
#define IFX_GTM_DPLL_THVAL2_THVAL_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_THVAL2_Bits.THVAL */
#define IFX_GTM_DPLL_THVAL2_THVAL_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_TIDEL_Bits.TIDEL */
#define IFX_GTM_DPLL_TIDEL_TIDEL_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_TIDEL_Bits.TIDEL */
#define IFX_GTM_DPLL_TIDEL_TIDEL_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_TIDEL_Bits.TIDEL */
#define IFX_GTM_DPLL_TIDEL_TIDEL_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_SIDEL_Bits.SIDEL */
#define IFX_GTM_DPLL_SIDEL_SIDEL_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_SIDEL_Bits.SIDEL */
#define IFX_GTM_DPLL_SIDEL_SIDEL_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_SIDEL_Bits.SIDEL */
#define IFX_GTM_DPLL_SIDEL_SIDEL_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_APS_SYNC_EXT_Bits.APS_1C2_EXT */
#define IFX_GTM_DPLL_APS_SYNC_EXT_APS_1C2_EXT_LEN (7u)

/** \brief Mask for Ifx_GTM_DPLL_APS_SYNC_EXT_Bits.APS_1C2_EXT */
#define IFX_GTM_DPLL_APS_SYNC_EXT_APS_1C2_EXT_MSK (0x7fu)

/** \brief Offset for Ifx_GTM_DPLL_APS_SYNC_EXT_Bits.APS_1C2_EXT */
#define IFX_GTM_DPLL_APS_SYNC_EXT_APS_1C2_EXT_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_APS_SYNC_EXT_Bits.APS_1C2_STATUS */
#define IFX_GTM_DPLL_APS_SYNC_EXT_APS_1C2_STATUS_LEN (1u)

