Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_DSADCINSEL_Bits.INSEL7 */
#define IFX_GTM_DSADCINSEL_INSEL7_OFF (28u)

/** \brief Length for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_DSADC_OUTSEL0_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_DSADC_OUTSEL0_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_DSADC_OUTSEL0_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_DSADC_OUTSEL0_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_DSADC_OUTSEL0_SEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_DSADC_OUTSEL0_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_DSADC_OUTSEL0_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_DSADC_OUTSEL0_SEL2_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_DSADC_OUTSEL0_SEL2_OFF (8u)

/** \brief Length for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_DSADC_OUTSEL0_SEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_DSADC_OUTSEL0_SEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_DSADC_OUTSEL0_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_DSADC_OUTSEL0_SEL4_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_DSADC_OUTSEL0_SEL4_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_DSADC_OUTSEL0_SEL4_OFF (16u)

/** \brief Length for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_DSADC_OUTSEL0_SEL5_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_DSADC_OUTSEL0_SEL5_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_DSADC_OUTSEL0_SEL5_OFF (20u)

/** \brief Length for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL6 */
#define IFX_GTM_DSADC_OUTSEL0_SEL6_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL6 */
#define IFX_GTM_DSADC_OUTSEL0_SEL6_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL6 */
#define IFX_GTM_DSADC_OUTSEL0_SEL6_OFF (24u)

/** \brief Length for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL7 */
#define IFX_GTM_DSADC_OUTSEL0_SEL7_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL7 */
#define IFX_GTM_DSADC_OUTSEL0_SEL7_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADC_OUTSEL0_Bits.SEL7 */
#define IFX_GTM_DSADC_OUTSEL0_SEL7_OFF (28u)

/** \brief Length for Ifx_GTM_DSADC_OUTSEL1_Bits.SEL8 */
#define IFX_GTM_DSADC_OUTSEL1_SEL8_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADC_OUTSEL1_Bits.SEL8 */
#define IFX_GTM_DSADC_OUTSEL1_SEL8_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADC_OUTSEL1_Bits.SEL8 */
#define IFX_GTM_DSADC_OUTSEL1_SEL8_OFF (0u)

/** \brief Length for Ifx_GTM_DSADC_OUTSEL1_Bits.SEL9 */
#define IFX_GTM_DSADC_OUTSEL1_SEL9_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADC_OUTSEL1_Bits.SEL9 */
#define IFX_GTM_DSADC_OUTSEL1_SEL9_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADC_OUTSEL1_Bits.SEL9 */
#define IFX_GTM_DSADC_OUTSEL1_SEL9_OFF (4u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL0 */
#define IFX_GTM_ADCTRIG_OUT0_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL0 */
#define IFX_GTM_ADCTRIG_OUT0_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL0 */
#define IFX_GTM_ADCTRIG_OUT0_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG_OUT0_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG_OUT0_SEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG_OUT0_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG_OUT0_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG_OUT0_SEL2_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG_OUT0_SEL2_OFF (8u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL3 */
#define IFX_GTM_ADCTRIG_OUT0_SEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL3 */
#define IFX_GTM_ADCTRIG_OUT0_SEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL3 */
#define IFX_GTM_ADCTRIG_OUT0_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL4 */
#define IFX_GTM_ADCTRIG_OUT0_SEL4_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL4 */
#define IFX_GTM_ADCTRIG_OUT0_SEL4_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL4 */
#define IFX_GTM_ADCTRIG_OUT0_SEL4_OFF (16u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL5 */
#define IFX_GTM_ADCTRIG_OUT0_SEL5_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL5 */
#define IFX_GTM_ADCTRIG_OUT0_SEL5_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL5 */
#define IFX_GTM_ADCTRIG_OUT0_SEL5_OFF (20u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG_OUT0_SEL6_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG_OUT0_SEL6_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG_OUT0_SEL6_OFF (24u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG_OUT0_SEL7_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG_OUT0_SEL7_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG_OUT0_SEL7_OFF (28u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG_OUT1_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG_OUT1_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG_OUT1_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL1 */
#define IFX_GTM_ADCTRIG_OUT1_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL1 */
#define IFX_GTM_ADCTRIG_OUT1_SEL1_MSK (0xfu)

