Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL1 */
#define IFX_GTM_ADCTRIG_OUT1_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL2 */
#define IFX_GTM_ADCTRIG_OUT1_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL2 */
#define IFX_GTM_ADCTRIG_OUT1_SEL2_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL2 */
#define IFX_GTM_ADCTRIG_OUT1_SEL2_OFF (8u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL3 */
#define IFX_GTM_ADCTRIG_OUT1_SEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL3 */
#define IFX_GTM_ADCTRIG_OUT1_SEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL3 */
#define IFX_GTM_ADCTRIG_OUT1_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT0 */
#define IFX_GTM_DXOUTCON_OUT0_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT0 */
#define IFX_GTM_DXOUTCON_OUT0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT0 */
#define IFX_GTM_DXOUTCON_OUT0_OFF (0u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT1 */
#define IFX_GTM_DXOUTCON_OUT1_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT1 */
#define IFX_GTM_DXOUTCON_OUT1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT1 */
#define IFX_GTM_DXOUTCON_OUT1_OFF (1u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT2 */
#define IFX_GTM_DXOUTCON_OUT2_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT2 */
#define IFX_GTM_DXOUTCON_OUT2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT2 */
#define IFX_GTM_DXOUTCON_OUT2_OFF (2u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT3 */
#define IFX_GTM_DXOUTCON_OUT3_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT3 */
#define IFX_GTM_DXOUTCON_OUT3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT3 */
#define IFX_GTM_DXOUTCON_OUT3_OFF (3u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT4 */
#define IFX_GTM_DXOUTCON_OUT4_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT4 */
#define IFX_GTM_DXOUTCON_OUT4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT4 */
#define IFX_GTM_DXOUTCON_OUT4_OFF (4u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT5 */
#define IFX_GTM_DXOUTCON_OUT5_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT5 */
#define IFX_GTM_DXOUTCON_OUT5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT5 */
#define IFX_GTM_DXOUTCON_OUT5_OFF (5u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT6 */
#define IFX_GTM_DXOUTCON_OUT6_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT6 */
#define IFX_GTM_DXOUTCON_OUT6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT6 */
#define IFX_GTM_DXOUTCON_OUT6_OFF (6u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG0 */
#define IFX_GTM_TRIGOUT_TRIG0_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG0 */
#define IFX_GTM_TRIGOUT_TRIG0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG0 */
#define IFX_GTM_TRIGOUT_TRIG0_OFF (0u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG1 */
#define IFX_GTM_TRIGOUT_TRIG1_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG1 */
#define IFX_GTM_TRIGOUT_TRIG1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG1 */
#define IFX_GTM_TRIGOUT_TRIG1_OFF (2u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG2 */
#define IFX_GTM_TRIGOUT_TRIG2_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG2 */
#define IFX_GTM_TRIGOUT_TRIG2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG2 */
#define IFX_GTM_TRIGOUT_TRIG2_OFF (4u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG3 */
#define IFX_GTM_TRIGOUT_TRIG3_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG3 */
#define IFX_GTM_TRIGOUT_TRIG3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG3 */
#define IFX_GTM_TRIGOUT_TRIG3_OFF (6u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG4 */
#define IFX_GTM_TRIGOUT_TRIG4_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG4 */
#define IFX_GTM_TRIGOUT_TRIG4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG4 */
#define IFX_GTM_TRIGOUT_TRIG4_OFF (8u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG5 */
#define IFX_GTM_TRIGOUT_TRIG5_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG5 */
#define IFX_GTM_TRIGOUT_TRIG5_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG5 */
#define IFX_GTM_TRIGOUT_TRIG5_OFF (10u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG6 */
#define IFX_GTM_TRIGOUT_TRIG6_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG6 */
#define IFX_GTM_TRIGOUT_TRIG6_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG6 */
#define IFX_GTM_TRIGOUT_TRIG6_OFF (12u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG7 */
#define IFX_GTM_TRIGOUT_TRIG7_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG7 */
#define IFX_GTM_TRIGOUT_TRIG7_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG7 */
#define IFX_GTM_TRIGOUT_TRIG7_OFF (14u)

/** \brief Length for Ifx_GTM_INTOUT_Bits.INT0 */
#define IFX_GTM_INTOUT_INT0_LEN (2u)

/** \brief Mask for Ifx_GTM_INTOUT_Bits.INT0 */
#define IFX_GTM_INTOUT_INT0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_INTOUT_Bits.INT0 */
#define IFX_GTM_INTOUT_INT0_OFF (0u)

/** \brief Length for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL0 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL0 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL0 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL1 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL1 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL1 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL2 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL2 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL2_MSK (0xfu)

/** \brief Offset for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL2 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL2_OFF (8u)

/** \brief Length for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL3 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL3 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL3 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS00 */
#define IFX_GTM_MCSINTSTAT_MCS00_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS00 */
#define IFX_GTM_MCSINTSTAT_MCS00_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS00 */
#define IFX_GTM_MCSINTSTAT_MCS00_OFF (0u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS10 */
#define IFX_GTM_MCSINTSTAT_MCS10_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS10 */
#define IFX_GTM_MCSINTSTAT_MCS10_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS10 */
#define IFX_GTM_MCSINTSTAT_MCS10_OFF (1u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS20 */
#define IFX_GTM_MCSINTSTAT_MCS20_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS20 */
#define IFX_GTM_MCSINTSTAT_MCS20_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS20 */
#define IFX_GTM_MCSINTSTAT_MCS20_OFF (2u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS30 */
#define IFX_GTM_MCSINTSTAT_MCS30_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS30 */
#define IFX_GTM_MCSINTSTAT_MCS30_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS30 */
#define IFX_GTM_MCSINTSTAT_MCS30_OFF (3u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS40 */
#define IFX_GTM_MCSINTSTAT_MCS40_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS40 */
#define IFX_GTM_MCSINTSTAT_MCS40_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS40 */
#define IFX_GTM_MCSINTSTAT_MCS40_OFF (4u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS50 */
#define IFX_GTM_MCSINTSTAT_MCS50_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS50 */
#define IFX_GTM_MCSINTSTAT_MCS50_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS50 */
#define IFX_GTM_MCSINTSTAT_MCS50_OFF (5u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS60 */
#define IFX_GTM_MCSINTSTAT_MCS60_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS60 */
#define IFX_GTM_MCSINTSTAT_MCS60_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS60 */
#define IFX_GTM_MCSINTSTAT_MCS60_OFF (6u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS0 */
#define IFX_GTM_MCSINTCLR_MCS0_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS0 */
#define IFX_GTM_MCSINTCLR_MCS0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS0 */
#define IFX_GTM_MCSINTCLR_MCS0_OFF (0u)

