Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS1 */
#define IFX_GTM_MCSINTCLR_MCS1_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS1 */
#define IFX_GTM_MCSINTCLR_MCS1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS1 */
#define IFX_GTM_MCSINTCLR_MCS1_OFF (1u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS2 */
#define IFX_GTM_MCSINTCLR_MCS2_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS2 */
#define IFX_GTM_MCSINTCLR_MCS2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS2 */
#define IFX_GTM_MCSINTCLR_MCS2_OFF (2u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS3 */
#define IFX_GTM_MCSINTCLR_MCS3_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS3 */
#define IFX_GTM_MCSINTCLR_MCS3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS3 */
#define IFX_GTM_MCSINTCLR_MCS3_OFF (3u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS4 */
#define IFX_GTM_MCSINTCLR_MCS4_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS4 */
#define IFX_GTM_MCSINTCLR_MCS4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS4 */
#define IFX_GTM_MCSINTCLR_MCS4_OFF (4u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS5 */
#define IFX_GTM_MCSINTCLR_MCS5_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS5 */
#define IFX_GTM_MCSINTCLR_MCS5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS5 */
#define IFX_GTM_MCSINTCLR_MCS5_OFF (5u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS6 */
#define IFX_GTM_MCSINTCLR_MCS6_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS6 */
#define IFX_GTM_MCSINTCLR_MCS6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS6 */
#define IFX_GTM_MCSINTCLR_MCS6_OFF (6u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN0 */
#define IFX_GTM_DXINCON_IN0_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN0 */
#define IFX_GTM_DXINCON_IN0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN0 */
#define IFX_GTM_DXINCON_IN0_OFF (0u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN1 */
#define IFX_GTM_DXINCON_IN1_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN1 */
#define IFX_GTM_DXINCON_IN1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN1 */
#define IFX_GTM_DXINCON_IN1_OFF (1u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN2 */
#define IFX_GTM_DXINCON_IN2_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN2 */
#define IFX_GTM_DXINCON_IN2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN2 */
#define IFX_GTM_DXINCON_IN2_OFF (2u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN3 */
#define IFX_GTM_DXINCON_IN3_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN3 */
#define IFX_GTM_DXINCON_IN3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN3 */
#define IFX_GTM_DXINCON_IN3_OFF (3u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN4 */
#define IFX_GTM_DXINCON_IN4_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN4 */
#define IFX_GTM_DXINCON_IN4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN4 */
#define IFX_GTM_DXINCON_IN4_OFF (4u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN5 */
#define IFX_GTM_DXINCON_IN5_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN5 */
#define IFX_GTM_DXINCON_IN5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN5 */
#define IFX_GTM_DXINCON_IN5_OFF (5u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN6 */
#define IFX_GTM_DXINCON_IN6_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN6 */
#define IFX_GTM_DXINCON_IN6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN6 */
#define IFX_GTM_DXINCON_IN6_OFF (6u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS0 */
#define IFX_GTM_DXINCON_DSS0_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS0 */
#define IFX_GTM_DXINCON_DSS0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS0 */
#define IFX_GTM_DXINCON_DSS0_OFF (16u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS1 */
#define IFX_GTM_DXINCON_DSS1_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS1 */
#define IFX_GTM_DXINCON_DSS1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS1 */
#define IFX_GTM_DXINCON_DSS1_OFF (17u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS2 */
#define IFX_GTM_DXINCON_DSS2_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS2 */
#define IFX_GTM_DXINCON_DSS2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS2 */
#define IFX_GTM_DXINCON_DSS2_OFF (18u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS3 */
#define IFX_GTM_DXINCON_DSS3_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS3 */
#define IFX_GTM_DXINCON_DSS3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS3 */
#define IFX_GTM_DXINCON_DSS3_OFF (19u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS4 */
#define IFX_GTM_DXINCON_DSS4_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS4 */
#define IFX_GTM_DXINCON_DSS4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS4 */
#define IFX_GTM_DXINCON_DSS4_OFF (20u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS5 */
#define IFX_GTM_DXINCON_DSS5_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS5 */
#define IFX_GTM_DXINCON_DSS5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS5 */
#define IFX_GTM_DXINCON_DSS5_OFF (21u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS6 */
#define IFX_GTM_DXINCON_DSS6_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS6 */
#define IFX_GTM_DXINCON_DSS6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS6 */
#define IFX_GTM_DXINCON_DSS6_OFF (22u)

/** \brief Length for Ifx_GTM_DATAIN_Bits.DATA */
#define IFX_GTM_DATAIN_DATA_LEN (32u)

/** \brief Mask for Ifx_GTM_DATAIN_Bits.DATA */
#define IFX_GTM_DATAIN_DATA_MSK (0xffffffffu)

/** \brief Offset for Ifx_GTM_DATAIN_Bits.DATA */
#define IFX_GTM_DATAIN_DATA_OFF (0u)

/** \brief Length for Ifx_GTM_MSC_SET_CON0_Bits.SEL0 */
#define IFX_GTM_MSC_SET_CON0_SEL0_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON0_Bits.SEL0 */
#define IFX_GTM_MSC_SET_CON0_SEL0_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON0_Bits.SEL0 */
#define IFX_GTM_MSC_SET_CON0_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_MSC_SET_CON0_Bits.SEL1 */
#define IFX_GTM_MSC_SET_CON0_SEL1_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON0_Bits.SEL1 */
#define IFX_GTM_MSC_SET_CON0_SEL1_MSK (0x1fu)

