Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_MSC_MSCQ_INLEXTCON_Bits.SEL12 */
#define IFX_GTM_MSC_MSCQ_INLEXTCON_SEL12_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INLEXTCON_Bits.SEL12 */
#define IFX_GTM_MSC_MSCQ_INLEXTCON_SEL12_OFF (24u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INLEXTCON_Bits.SEL13 */
#define IFX_GTM_MSC_MSCQ_INLEXTCON_SEL13_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INLEXTCON_Bits.SEL13 */
#define IFX_GTM_MSC_MSCQ_INLEXTCON_SEL13_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INLEXTCON_Bits.SEL13 */
#define IFX_GTM_MSC_MSCQ_INLEXTCON_SEL13_OFF (26u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INLEXTCON_Bits.SEL14 */
#define IFX_GTM_MSC_MSCQ_INLEXTCON_SEL14_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INLEXTCON_Bits.SEL14 */
#define IFX_GTM_MSC_MSCQ_INLEXTCON_SEL14_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INLEXTCON_Bits.SEL14 */
#define IFX_GTM_MSC_MSCQ_INLEXTCON_SEL14_OFF (28u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INLEXTCON_Bits.SEL15 */
#define IFX_GTM_MSC_MSCQ_INLEXTCON_SEL15_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INLEXTCON_Bits.SEL15 */
#define IFX_GTM_MSC_MSCQ_INLEXTCON_SEL15_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INLEXTCON_Bits.SEL15 */
#define IFX_GTM_MSC_MSCQ_INLEXTCON_SEL15_OFF (30u)

/** \brief Length for Ifx_GTM_PSI5OUTSEL_Bits.SEL0 */
#define IFX_GTM_PSI5OUTSEL_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5OUTSEL_Bits.SEL0 */
#define IFX_GTM_PSI5OUTSEL_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5OUTSEL_Bits.SEL0 */
#define IFX_GTM_PSI5OUTSEL_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_PSI5OUTSEL_Bits.SEL1 */
#define IFX_GTM_PSI5OUTSEL_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5OUTSEL_Bits.SEL1 */
#define IFX_GTM_PSI5OUTSEL_SEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5OUTSEL_Bits.SEL1 */
#define IFX_GTM_PSI5OUTSEL_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_PSI5OUTSEL_Bits.SEL2 */
#define IFX_GTM_PSI5OUTSEL_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5OUTSEL_Bits.SEL2 */
#define IFX_GTM_PSI5OUTSEL_SEL2_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5OUTSEL_Bits.SEL2 */
#define IFX_GTM_PSI5OUTSEL_SEL2_OFF (8u)

/** \brief Length for Ifx_GTM_PSI5OUTSEL_Bits.SEL3 */
#define IFX_GTM_PSI5OUTSEL_SEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5OUTSEL_Bits.SEL3 */
#define IFX_GTM_PSI5OUTSEL_SEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5OUTSEL_Bits.SEL3 */
#define IFX_GTM_PSI5OUTSEL_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_PSI5OUTSEL_Bits.SEL4 */
#define IFX_GTM_PSI5OUTSEL_SEL4_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5OUTSEL_Bits.SEL4 */
#define IFX_GTM_PSI5OUTSEL_SEL4_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5OUTSEL_Bits.SEL4 */
#define IFX_GTM_PSI5OUTSEL_SEL4_OFF (16u)

/** \brief Length for Ifx_GTM_PSI5OUTSEL_Bits.SEL5 */
#define IFX_GTM_PSI5OUTSEL_SEL5_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5OUTSEL_Bits.SEL5 */
#define IFX_GTM_PSI5OUTSEL_SEL5_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5OUTSEL_Bits.SEL5 */
#define IFX_GTM_PSI5OUTSEL_SEL5_OFF (20u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL0 */
#define IFX_GTM_PSI5SOUTSEL_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL0 */
#define IFX_GTM_PSI5SOUTSEL_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL0 */
#define IFX_GTM_PSI5SOUTSEL_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL1 */
#define IFX_GTM_PSI5SOUTSEL_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL1 */
#define IFX_GTM_PSI5SOUTSEL_SEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL1 */
#define IFX_GTM_PSI5SOUTSEL_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL2 */
#define IFX_GTM_PSI5SOUTSEL_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL2 */
#define IFX_GTM_PSI5SOUTSEL_SEL2_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL2 */
#define IFX_GTM_PSI5SOUTSEL_SEL2_OFF (8u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL3 */
#define IFX_GTM_PSI5SOUTSEL_SEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL3 */
#define IFX_GTM_PSI5SOUTSEL_SEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL3 */
#define IFX_GTM_PSI5SOUTSEL_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL4 */
#define IFX_GTM_PSI5SOUTSEL_SEL4_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL4 */
#define IFX_GTM_PSI5SOUTSEL_SEL4_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL4 */
#define IFX_GTM_PSI5SOUTSEL_SEL4_OFF (16u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL5 */
#define IFX_GTM_PSI5SOUTSEL_SEL5_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL5 */
#define IFX_GTM_PSI5SOUTSEL_SEL5_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL5 */
#define IFX_GTM_PSI5SOUTSEL_SEL5_OFF (20u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL6 */
#define IFX_GTM_PSI5SOUTSEL_SEL6_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL6 */
#define IFX_GTM_PSI5SOUTSEL_SEL6_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL6 */
#define IFX_GTM_PSI5SOUTSEL_SEL6_OFF (24u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL7 */
#define IFX_GTM_PSI5SOUTSEL_SEL7_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL7 */
#define IFX_GTM_PSI5SOUTSEL_SEL7_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL7 */
#define IFX_GTM_PSI5SOUTSEL_SEL7_OFF (28u)

/** \brief Length for Ifx_GTM_LCDCDCOUTSEL_Bits.SEL */
#define IFX_GTM_LCDCDCOUTSEL_SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_LCDCDCOUTSEL_Bits.SEL */
#define IFX_GTM_LCDCDCOUTSEL_SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_LCDCDCOUTSEL_Bits.SEL */
#define IFX_GTM_LCDCDCOUTSEL_SEL_OFF (0u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL0 */
#define IFX_GTM_DTMAUXINSEL_ASEL0_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL0 */
#define IFX_GTM_DTMAUXINSEL_ASEL0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL0 */
#define IFX_GTM_DTMAUXINSEL_ASEL0_OFF (0u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL1 */
#define IFX_GTM_DTMAUXINSEL_ASEL1_LEN (2u)

