Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_I_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_I_OUT_N_LEN (8u)

/** \brief Mask for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_I_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_I_OUT_N_MSK (0xffu)

/** \brief Offset for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_I_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_I_OUT_N_OFF (8u)

/** \brief Length for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_LEN (8u)

/** \brief Mask for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_MSK (0xffu)

/** \brief Offset for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_OFF (16u)

/** \brief Length for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_N_LEN (8u)

/** \brief Mask for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_N_MSK (0xffu)

/** \brief Offset for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_N_OFF (24u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK0_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK0_SRC_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK0_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK0_SRC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK0_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK0_SRC_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK1_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK1_SRC_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK1_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK1_SRC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK1_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK1_SRC_OFF (4u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK2_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK2_SRC_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK2_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK2_SRC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK2_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK2_SRC_OFF (8u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK3_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK3_SRC_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK3_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK3_SRC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK3_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK3_SRC_OFF (12u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK4_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK4_SRC_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK4_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK4_SRC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK4_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK4_SRC_OFF (16u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK5_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK5_SRC_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK5_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK5_SRC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK5_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK5_SRC_OFF (20u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK6_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK6_SRC_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK6_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK6_SRC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK6_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK6_SRC_OFF (24u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK7_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK7_SRC_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK7_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK7_SRC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK7_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK7_SRC_OFF (28u)

/** \brief Length for Ifx_GTM_CCM_CMU_FXCLK_CFG_Bits.FXCLK0_SRC */
#define IFX_GTM_CCM_CMU_FXCLK_CFG_FXCLK0_SRC_LEN (4u)

/** \brief Mask for Ifx_GTM_CCM_CMU_FXCLK_CFG_Bits.FXCLK0_SRC */
#define IFX_GTM_CCM_CMU_FXCLK_CFG_FXCLK0_SRC_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CCM_CMU_FXCLK_CFG_Bits.FXCLK0_SRC */
#define IFX_GTM_CCM_CMU_FXCLK_CFG_FXCLK0_SRC_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_CFG_Bits.EN_TIM */
#define IFX_GTM_CCM_CFG_EN_TIM_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_CFG_Bits.EN_TIM */
#define IFX_GTM_CCM_CFG_EN_TIM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_CFG_Bits.EN_TIM */
#define IFX_GTM_CCM_CFG_EN_TIM_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_CFG_Bits.EN_TOM_SPE_TDTM */
#define IFX_GTM_CCM_CFG_EN_TOM_SPE_TDTM_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_CFG_Bits.EN_TOM_SPE_TDTM */
#define IFX_GTM_CCM_CFG_EN_TOM_SPE_TDTM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_CFG_Bits.EN_TOM_SPE_TDTM */
#define IFX_GTM_CCM_CFG_EN_TOM_SPE_TDTM_OFF (1u)

/** \brief Length for Ifx_GTM_CCM_CFG_Bits.EN_ATOM_ADTM */
#define IFX_GTM_CCM_CFG_EN_ATOM_ADTM_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_CFG_Bits.EN_ATOM_ADTM */
#define IFX_GTM_CCM_CFG_EN_ATOM_ADTM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_CFG_Bits.EN_ATOM_ADTM */
#define IFX_GTM_CCM_CFG_EN_ATOM_ADTM_OFF (2u)

/** \brief Length for Ifx_GTM_CCM_CFG_Bits.EN_MCS */
#define IFX_GTM_CCM_CFG_EN_MCS_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_CFG_Bits.EN_MCS */
#define IFX_GTM_CCM_CFG_EN_MCS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_CFG_Bits.EN_MCS */
#define IFX_GTM_CCM_CFG_EN_MCS_OFF (3u)

/** \brief Length for Ifx_GTM_CCM_CFG_Bits.EN_DPLL_MAP */
#define IFX_GTM_CCM_CFG_EN_DPLL_MAP_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_CFG_Bits.EN_DPLL_MAP */
#define IFX_GTM_CCM_CFG_EN_DPLL_MAP_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_CFG_Bits.EN_DPLL_MAP */
#define IFX_GTM_CCM_CFG_EN_DPLL_MAP_OFF (4u)

/** \brief Length for Ifx_GTM_CCM_CFG_Bits.EN_BRC */
#define IFX_GTM_CCM_CFG_EN_BRC_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_CFG_Bits.EN_BRC */
#define IFX_GTM_CCM_CFG_EN_BRC_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_CFG_Bits.EN_BRC */
#define IFX_GTM_CCM_CFG_EN_BRC_OFF (5u)

/** \brief Length for Ifx_GTM_CCM_CFG_Bits.EN_PSM */
#define IFX_GTM_CCM_CFG_EN_PSM_LEN (1u)

